ybharatu/Third_Eye_Not_Blind/NRF52_code/peripheral_micro/main.c
BLE_LBS_DEF(m_lbs);                                                             /**< LED Button Service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/

nrfx_timer_t timer_us = NRFX_TIMER_INSTANCE(2);

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

uint32_t distance = 0;
uint32_t atd_result = 0;
uint32_t prev_value;
uint32_t far_count = 5;
uint32_t close_count = 0;

nrf_saadc_value_t p_value = 0;
static nrf_saadc_value_t m_buffer[SAMPLES_IN_BUFFER];

char * close = "CLOSE:    ";
char * far = "FAR:    ";
const char * text = "";

uint32_t seconds = 0;

uint8_t i = 0;

float average = 0;
int curr_index = 0;
float all_distances[BUFFER_SIZE];
int first = 1;
int sum = 0;
float std_dev = 0;
float var_sum = 500;
float new_average = 0;
float variance = 0;

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void gpio_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
    nrf_gpio_cfg_output(CONNECTED_LED);
    nrf_gpio_cfg_output(ADVERTISING_LED);
    nrf_gpio_cfg_output(TEST_LED);
    nrf_gpio_pin_write(ADVERTISING_LED,0);
    nrf_gpio_cfg_output(SENSOR_PIN);
    nrf_gpio_pin_write(SENSOR_PIN,1);
}

/************************************************
* Timer Event handler that uses the distance to
* determine if an object is in the blind spot.
* Sends that determination to the main micro
* for decision making
************************************************/
nrfx_timer_event_handler_t LVEZ4_measure(void){
    ret_code_t err_code;
    
    nrf_drv_saadc_sample();

    //NRF_LOG_INFO("Average Distance: %d", average);
   
    /************************************************
    * If Object is close and was previously far,
    * send 1 to main micro
    ************************************************/
    if(average < 60 && prev_value == 0){
      NRF_LOG_INFO("Switched from Far to Close\n");
      NRF_LOG_FLUSH();
      prev_value = 1;
       
      //NRF_LOG_INFO("Object is close! %d", close_count);
      err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, 1);
      if (err_code != NRF_SUCCESS &&
        err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
        err_code != NRF_ERROR_INVALID_STATE)
      {
        APP_ERROR_CHECK(err_code);
      }
      
    }
//    if(average < 60){
//      close_count += 1;
//      far_count = 0;
//      NRF_LOG_INFO("Incramented close_count: %d", close_count);
//    }

    /************************************************
    * If Object is far and was previously close, 
    * send 0 to main micro
    ************************************************/
    else if(average >= 60 && prev_value == 1){
      NRF_LOG_INFO("Switched from Close to Far\n");
      NRF_LOG_FLUSH();
      prev_value = 0;
      
      NRF_LOG_INFO("Object is far! %d", far_count);
      err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, 0);

      if (err_code != NRF_SUCCESS &&
        err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
        err_code != NRF_ERROR_INVALID_STATE)
      {
        APP_ERROR_CHECK(err_code);
      }
        
    }
//    if(average >= 60){
//      far_count += 1;
//      close_count = 0;
//      NRF_LOG_INFO("Incramented far_count: %d", far_count);
//    }

    NRF_LOG_FLUSH();
    nrfx_timer_clear(&timer_us);
   
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/************************************************
* Gets called when SAADC is invoked 
* (nrf_drv_saadc_sample()) in timer interrupt
************************************************/
void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
        p_value = p_event->data.done.p_buffer[0];
        distance = p_value;

        if(first){
          average = p_value;
          new_average = p_value;
          first = 0;
        }else{
//          if((p_value > (average + sqrt(variance)) || p_value < (average - sqrt(variance)))){
//            NRF_LOG_INFO("BAD DATA Boundary is: %d - %d",(average - sqrt(variance)), (average + sqrt(variance)) );
//            return;
//          }
          NRF_LOG_INFO("GOOD DATA");
          new_average = average + ((p_value - average) / BUFFER_SIZE);
          //new_average = average + (p_value / BUFFER_SIZE);
          NRF_LOG_INFO("PREV AVERAGE: %d  NEW AVERAGE: %d  ACTUAL DISTANCE: %d", average, new_average, p_value);
          var_sum = var_sum + (p_value - average)*(p_value - new_average);
          average = new_average;
          variance = var_sum / (BUFFER_SIZE - 1);
        }
    }
}

/************************************************
* Initializes ATD to sample analog input 6
************************************************/
void saadc_init(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config 
        = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);
    
    //channel_config.gain = NRF_SAADC_GAIN1;

    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

