ybharatu/Third_Eye_Not_Blind/NRF52_code/peripheral_micro/main.c
    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize LBS.
    init.led_write_handler = led_write_handler;

    err_code = ble_lbs_init(&m_lbs, &init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    int send_bit = 1;
    int i = 0;
    // Initialize.
    log_init();
    timer_init();
    gpio_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    saadc_init();
    simple_timer_init();
    


    // Start execution.
    NRF_LOG_INFO("Blinky CENTRAL example started.");
    advertising_start();

    nrf_gpio_pin_write(SENSOR_PIN,1);

    // Enter main loop.
    for (;;)
    {
//        nrf_delay_ms(500);
//        send_bit = !send_bit;
//        err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, send_bit);
//        if (err_code != NRF_SUCCESS &&
//            err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
//            err_code != NRF_ERROR_INVALID_STATE &&
//            err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//        {
//            APP_ERROR_CHECK(err_code);
//        }
        idle_state_handle();
        
        //NRF_LOG_INFO("Current Distance: %d\n", p_value);
    }
}


/**
 * @}
 */